backend: tensorflow
class_name: Model
config:
  input_layers:
  - - input_2
    - 0
    - 0
  - - input_3
    - 0
    - 0
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 30
      - 300
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 30
      - 300
      dtype: float32
      name: input_3
      sparse: false
    inbound_nodes: []
    name: input_3
  - class_name: Model
    config:
      input_layers:
      - - input_1
        - 0
        - 0
      layers:
      - class_name: InputLayer
        config:
          batch_input_shape: !!python/tuple
          - null
          - 30
          - 300
          dtype: float32
          name: input_1
          sparse: false
        inbound_nodes: []
        name: input_1
      - class_name: Conv1D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 48
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: uniform
              mode: fan_avg
              scale: 1.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          name: conv1d_4
          padding: same
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - input_1
            - 0
            - 0
            - {}
        name: conv1d_4
      - class_name: Conv1D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 48
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: uniform
              mode: fan_avg
              scale: 1.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          name: conv1d_2
          padding: same
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - input_1
            - 0
            - 0
            - {}
        name: conv1d_2
      - class_name: Conv1D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: uniform
              mode: fan_avg
              scale: 1.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          name: conv1d_5
          padding: same
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - conv1d_4
            - 0
            - 0
            - {}
        name: conv1d_5
      - class_name: MaxPooling1D
        config:
          data_format: channels_last
          dtype: float32
          name: max_pooling1d_1
          padding: same
          pool_size: !!python/tuple
          - 2
          strides: !!python/tuple
          - 1
          trainable: true
        inbound_nodes:
        - - - input_1
            - 0
            - 0
            - {}
        name: max_pooling1d_1
      - class_name: Conv1D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 48
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: uniform
              mode: fan_avg
              scale: 1.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          name: conv1d_1
          padding: same
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - input_1
            - 0
            - 0
            - {}
        name: conv1d_1
      - class_name: Conv1D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 56
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: uniform
              mode: fan_avg
              scale: 1.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          name: conv1d_3
          padding: same
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - conv1d_2
            - 0
            - 0
            - {}
        name: conv1d_3
      - class_name: Conv1D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 64
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: uniform
              mode: fan_avg
              scale: 1.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 3
          name: conv1d_6
          padding: same
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - conv1d_5
            - 0
            - 0
            - {}
        name: conv1d_6
      - class_name: Conv1D
        config:
          activation: relu
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          data_format: channels_last
          dilation_rate: !!python/tuple
          - 1
          dtype: float32
          filters: 32
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: uniform
              mode: fan_avg
              scale: 1.0
              seed: null
          kernel_regularizer: null
          kernel_size: !!python/tuple
          - 1
          name: conv1d_7
          padding: same
          strides: !!python/tuple
          - 1
          trainable: true
          use_bias: true
        inbound_nodes:
        - - - max_pooling1d_1
            - 0
            - 0
            - {}
        name: conv1d_7
      - class_name: Concatenate
        config:
          axis: 2
          dtype: float32
          name: concatenate_1
          trainable: true
        inbound_nodes:
        - - - conv1d_1
            - 0
            - 0
            - &id001 {}
          - - conv1d_3
            - 0
            - 0
            - *id001
          - - conv1d_6
            - 0
            - 0
            - *id001
          - - conv1d_7
            - 0
            - 0
            - *id001
        name: concatenate_1
      - class_name: LSTM
        config:
          activation: tanh
          activity_regularizer: null
          bias_constraint: null
          bias_initializer:
            class_name: Zeros
            config: {}
          bias_regularizer: null
          dropout: 0.0
          dtype: float32
          go_backwards: false
          implementation: 2
          kernel_constraint: null
          kernel_initializer:
            class_name: VarianceScaling
            config:
              distribution: uniform
              mode: fan_avg
              scale: 1.0
              seed: null
          kernel_regularizer: null
          name: lstm_1
          recurrent_activation: sigmoid
          recurrent_constraint: null
          recurrent_dropout: 0.0
          recurrent_initializer:
            class_name: Orthogonal
            config:
              gain: 1.0
              seed: null
          recurrent_regularizer: null
          return_sequences: false
          return_state: false
          stateful: false
          trainable: true
          unit_forget_bias: true
          units: 300
          unroll: false
          use_bias: true
        inbound_nodes:
        - - - concatenate_1
            - 0
            - 0
            - {}
        name: lstm_1
      name: model_1
      output_layers:
      - - lstm_1
        - 0
        - 0
    inbound_nodes:
    - - - input_2
        - 0
        - 0
        - {}
    - - - input_3
        - 0
        - 0
        - {}
    name: model_1
  - class_name: ManDist
    config:
      dtype: float32
      name: man_dist_1
      trainable: true
    inbound_nodes:
    - - - model_1
        - 1
        - 0
        - &id002 {}
      - - model_1
        - 2
        - 0
        - *id002
    name: man_dist_1
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config:
          distribution: uniform
          mode: fan_avg
          scale: 1.0
          seed: null
      kernel_regularizer: null
      name: dense_1
      trainable: true
      units: 1
      use_bias: true
    inbound_nodes:
    - - - man_dist_1
        - 0
        - 0
        - {}
    name: dense_1
  name: model_2
  output_layers:
  - - dense_1
    - 0
    - 0
keras_version: 2.3.1
